app/controllers/posts_controller.rb

    def create
        @post = Post.new(params[:post])

        if @post.save
---
INSERT INTO "posts" ("content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["content", "test"], ["created_at", Mon, 26 Aug 2013 17:25:58 UTC +00:00], ["title", "Test"], ["updated_at", Mon, 26 Aug 2013 17:25:58 UTC +00:00]]

    def update
        @post = Post.find(params[:id])
        if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "content" = 'Lorem ipsum dolor sit amet, consectetur adipiscing elit. Pellentesque non elit enim. Phasellus adipiscing faucibus leo condimentum consequat. Class aptent taciti sociosqu ad litora torquent per conubia nostra, per inceptos himenaeos. Sed dignissim laoreet quam. Cras vel justo sed eros aliquet consectetur id in nisl. Donec ac viverra ante, quis euismod nulla. Donec pretium odio turpis, et malesuada tellus posuere ullamcorper. Nulla enim est, scelerisque vel erat at, interdum tempus lorem. Proin sollicitudin arcu nulla, vel dapibus risus tempus molestie. Proin semper dignissim magna, a accumsan felis mollis quis. Donec sodales orci libero, id pellentesque libero cursus eget.